#include <iostream>
#include <string>
using namespace std;

int main() {
    char b[3][3]; // body of x o
    char win;
    for(int r =0; r <3; r++){
        for(int c=0; c<3; c++){
            cin>>b[r][c];          
        }
    }

    for(int r =0; r <3; r++){
        for(int c=0; c<3; c++){
            // عرض
            if(b[0][0] == b[0][1] && b[0][1] == b[0][2]&& b[0][0] == 'X' || b[0][0] == 'O' ){
                win = b[0][0];
                break;
            }  
            if(b[1][0] == b[1][1] && b[1][1] == b[1][2]&& b[1][0] == 'X' || b[1][0] == 'O' ){
                win = b[1][0];
                break;
            }
            if(b[2][0] == b[2][1] && b[2][1] == b[2][2] && b[2][0] == 'X' || b[2][0] == 'O'){
                win = b[2][0];
                break;
            }
            //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
            // طووووووووووووول
            if(b[0][0] == b[1][0] && b[1][0] == b[2][0] && b[0][0] == 'X' || b[0][0] == 'O'){
                win = b[0][0];
                break;
            }
            if(b[0][1] == b[1][1] && b[1][1] == b[2][1] && b[0][1] == 'X' || b[0][1] == 'O'){
                win = b[0][1];
                break;
            }
            if(b[0][2] == b[1][2] && b[1][2] == b[2][2] && b[0][2] == 'X' || b[0][2] == 'O'){
                win = b[0][2];
                break;
            }
            //~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
            // main and second diagonals
            if(b[0][0] == b[1][1] && b[1][1] == b[2][2] && b[0][0] == 'X' || b[0][0] == 'O'){
                win = b[0][0];
                break;
            }
            if(b[0][2] == b[1][1] && b[1][1] == b[2][0] && b[0][2] == 'X' || b[0][2] == 'O'){
                win = b[0][2];
                break;
            }   
        }
    }    
    
    if(win == 'X' || win == 'O'){
        cout <<win <<" wins";
    }else{
        cout <<"draw";
    }
}